Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: བདག་ལ་བྱེད་པ་དང་། གཞན་ལ་བྱེད་པ་ལ་སྙིང་རྗེ་བ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Acting compassionately toward oneself and others is a source of insight.

source: མཐའ་གཉི་ག་བསལ་བའི་སྙིང་རྗེ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to experience great compassion that dissolves duality.

source: ཆོས་ལ་སེམས་པ་ལ་མཆོག་ཏུ་དགའ་བར་བྱེད་པའི་དགའ་བ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Delighting in cultivating supreme joy when attending to the Dharma is a source of insight.

source: བླང་བ་མེད་པ་དང་དོར་བ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to be without acceptance and rejection.

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བའི་བཏང་སྙོམས་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Being impartial, free from attachment or aversion, is a source of insight.

source: གཉིས་དང་བྲལ་བ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to be free from duality.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Recollecting the Buddha is a source of insight.

source: ཆོས་ཀྱི་སྐུ་རབ་ཏུ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know dharmakāya.

source: ཆོས་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Recollecting the Dharma is a source of insight.

source: འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཉིད་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know the nature of reality beyond attachment.

source: དགེ་འདུན་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Recollecting the Saṅgha is a source of insight.

source: འདུས་མ་བྱས་སུ་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to comprehend it analytically as being unconditioned.

source: གཏོང་བ་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Recollecting generosity is a source of insight.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to let go of all afflictive emotions.

source: ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Recollecting moral conduct is a source of insight.

source: ཚུལ་ཁྲིམས་མངོན་པར་འདུ་བྱ་བ་མེད་པར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know that moral conduct is not actually something to be accumulated.

source: ལྷ་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Recollecting the gods is a source of insight.

source: རྣམ་པར་དག་པའི་ཆོས་ཉིད་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is the pure nature of reality.

source: ཐོས་པ་ལ་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Comprehending what one has learned is a source of insight.

source: འཇིག་རྟེན་ཐམས་ཅད་ལ་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to comprehend all worlds.

source: མ་བྱས་པའི་ལས་བྱེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Performing deeds to be done is a source of insight.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་པར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know the maturation of actions to be nonexistent.

source: ང་རྒྱལ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Being without pride is a source of insight.

source: ཡེ་ཤེས་ཆེན་པོ་ཐོབ་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to attain great wisdom.

source: བདག་གི་དོན་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Benefiting oneself is a source of insight.

source: གཉི་གའི་དོན་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to benefit both oneself and others.

source: ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཀུན་དུ་འཛིན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Upholding the eighty-four thousand Dharma teachings is a source of insight.

source: ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོངས་སུ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know the eighty-four thousand Dharma teachings.

source: ཆོས་བསྟན་པ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Knowing Dharma teachings is a source of insight.

source: འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to teach Dharma successfully.

source: སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Inspiring beings to embrace awakening is a source of insight.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་རབ་ཏུ་དགོད་པ་འདི་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to place beings on the level of nonregression through the perfection of insight and skillful means.

source: སྲིད་པར་འགྲོ་བར་སྐྱེ་བ་ཐམས་ཅད་ཀྱིས་སྐྲག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Being apprehensive of any birth as a being in worldly existence is a source of insight.

source: བསམས་བཞིན་དུ་སྐྱེ་བ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to be born according to one’s intentions.

source: སྒྲའི་རྗེས་སུ་འགྲོ་བའི་བཟོད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Acceptance that accords with language is a source of insight.

source: བསྒོམ་པ་ལས་བྱུང་བའི་བཟོད་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is acceptance that rises from cultivation.

source: ཟད་པ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Understanding decay is a source of insight.

source: མི་སྐྱེ་བར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to understand nonorigination.

source: རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Willing acceptance is a source of insight.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to accept the unborn nature of phenomena.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: The level of nonregression is a source of insight.

source: དབང་བསྐུར་བའི་ས་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is the level of empowerment.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Sitting down on the seat of awakening is a source of insight.

source: གང་ཅི་ཤེས་པར་བྱ་བ་དང་། ཐོས་པར་བྱ་བ་དང་། རྟོགས་པར་བྱ་བ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ། དེ་ཐམས་ཅད་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to perfectly awaken to unsurpassed complete and perfect awakening through insight that thinks, in a single moment, of everything whatsoever that is to be known, learned, realized, and perfectly awakened to.”

source: ཤེས་རབ་ཀྱི་རྩ་བ་དང་ལས་བསྟན་པ་འདི་བཤད་པ་ན། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད། དཔག་ཏུ་མེད་པ་དག་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ། །འཁོར་གྱི་ཁྱམས་རིན་པོ་ཆེ་བཀོད་པ་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: As this account of the sources and functions of insight was delivered, the countless unfathomable buddhafields of the ten directions trembled six times, as did the pavilion made of jewels.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Prajñākūṭa asked the Blessed One,

source: བཅོམ་ལྡན་འདས་གང་གིས། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་པ་འདི་དག་རབ་ཏུ་གཡོས་པར་གྱུར་པ་དང་། ནམ་མཁའ་ལ་གནས་པའི་འཁོར་གྱི་ཁྱམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: “What has caused these countless, unfathomable buddhafields of the ten directions, as well as this pavilion hovering in the sky, to tremble six times?”

source: རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་རྩ་བ་དང་། ལས་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི། འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་སྔོན་བཤད་པ་ན། རིགས་ཀྱི་བུ་ཁྱོད་ཉིད་ཀྱིས་ནམ་མཁའ་ཡོངས་སུ་འཛིན་པ་འདི་ཉིད་དུ། དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཡོངས་སུ་དྲིས་ཤིང་ཡོངས་སུ་དྲི་བ་བྱས་ཏེ། ས་ཆེན་པོ་གཡོས་པ་འཇིག་རྟེན་དུ་བྱུང་བའི་རྒྱུ་ནི་འདི་ཡིན་ནོ། །རྐྱེན་ནི་འདི་ཡིན་ནོ། །
en: “Son of noble family, when the tathāgatas of the past previously explained this Dharma discourse on the sources and functions of insight, upon your request and inquiry, son of noble family, it caused the great world to tremble and the earth to quake in the very space that holds it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་སྤོབས་པ་ཞེས་བྱ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then a bodhisattva called Prati­bhāna­pratisaṃvid asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་ལ་ཤེས་རབ་བརྩེགས་ཞེས་བགྱི།
en: “Blessed One, why is the bodhisattva Prajñākūṭa called Prajñākūṭa?”

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དྲི་མ་མེད་པའི་བསྐལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་འབྱུང་བ་བཟང་པོ་ན། དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་ཞེས་བྱ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་གྱུར་པ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Son of noble family, once in past times, during the Stainless eon, in the world Virtuous Occurrence, there appeared a tathāgata, a blessed buddha named Glorious Secret.

source: འཇིག་རྟེན་གྱི་ཁམས་འབྱུང་བ་བཟང་པོ་དེའི་སེམས་ཅན་རྣམས་ནི་བདེ་བས་ཚིམ་པས་གནས་པར་གྱུར་ཏོ། །
en: The inhabitants of that world lived with a bliss-filled state of mind.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་དེའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་སུ་གྱུར་ཏོ། །དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་ཉན་ཐོས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིར་གྱུར་ཏོ། །
en: The Tathāgata’s bodhisattva saṅgha consisted of forty-two thousand bodhisattvas, and his śrāvaka saṅgha comprised eighty-four thousand śrāvakas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་དེས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སྤོབས་པ་རྒྱ་ཆེན་པོ་ཉེ་བར་བཟུང་སྟེ། དྲི་བ་བྱེ་བ་ཕྲག་བརྒྱ་ཆེད་དུ་མཛད་ནས།
en: “Son of noble family, this blessed one apprehended that the eloquence of those bodhisattvas was extensive, and he deliberately posed a large number of questions.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བཀའ་སྩལ་པ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱི་ནང་ནས་སུ་དུས་ཇི་སྲིད་ཅིག་ན། དྲི་བ་བྱེ་བ་ཕྲག་བརྒྱ་པོ་འདི་དྲི་བ་རེ་རེ་ལ་བསྟན་པ་བྱེ་བ་ཕྲག་བརྒྱ་བརྒྱས་ལན་འདེབས་པར་སྤྲོ།
en: He then inquired, ‘Noble beings, who among you would like to give comprehensive explanations in reply to each and every one of my many questions, at a time of your own choosing?’

source: དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་གིས་གསོལ་པ། མཚན་མོ་འདི་བས་ཏེ་ལན་གདབ་པར་བགྱིའོ། །
en: “One of them said, ‘I shall reply tonight,’

source: ཁ་ཅིག་གིས་གསོལ་པ། དགུང་བདུན་ནའོ། །
en: and another one said, ‘I shall reply in a week.’

source: ཁ་ཅིག་གིས་གསོལ་པ། དགུང་ཟླ་ཕྱེད་ནའོ། །
en: Another said, ‘I shall reply in a fortnight,’

source: ཁ་ཅིག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དྲིས་པ་འདི་དག་བདག་ཅག་གིས་དགུང་ཟླ་གཅིག་ན་ལན་གདབ་པར་བགྱིའོ། །
en: and yet another said, ‘Blessed One, I shall reply in one month.’

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པའི་བློ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་པ་དེས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Thereupon, a bodhisattva called Smṛtibuddhi, who was present in the retinue, replied,

source: བཅོམ་ལྡན་འདས་བདག་སྟན་ལས་མི་ལྡང་ཞིང་། སྤྱོད་ལམ་འཁྲུག་པ་མ་མཆིས་པར་དེ་བཞིན་གཤེགས་པ་དབང་དུ་བགྱིས་ཏེ་དྲི་བ་འདི་བས་པར་ལན་གདབ་པར་བགྱིའོ། །
en: ‘Blessed One, with the Tathāgata’s permission, without further ado, and without rising from my seat, I shall provide answers to the questions.’

source: སྐྱེས་བུ་དམ་པ་དེས་སེང་གེའི་སྒྲ་བསྒྲགས་མ་ཐག་ཏུ། དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: “As soon as the lion’s roar of this noble being resounded, the entire trichiliocosm trembled six times.

source: སྣང་བ་ཆེན་པོ་ཡང་འཇིག་རྟེན་དུ་བྱུང་བར་གྱུར་ཏོ། །
en: A great illumination appeared in the world.

source: སྣང་བ་དེས་བསྐུལ་ནས་ས་བླ་བའི་ལྷ་ནས་བཟུང་སྟེ། གནས་གཙང་མའི་རིས་ཀྱི་བར་གྱི་ལྷ་རྣམས་འདུས་སོ། །
en: Inspired by this light, all kinds of gods gathered, from the celestial gods up to the gods of the pure abodes.

source: དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་སྟོང་ཕྲག་མང་པོ་ཡང་འདིར་འདུས་པར་གྱུར་ཏོ། །དེ་ལྟར་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་དཔག་ཚད་སྟོང་ཕྲག་བཅུར་འཁོར་གྱི་དཀྱིལ་འཁོར་གཅིག་ཏུ་གནས་པར་གྱུར་ཏོ། །
en: Many thousands of monks and nuns, as well as male and female lay devotees, also congregated. All at once and in a single instant, they were transformed into a single ten-thousand-league maṇḍala retinue.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པའི་བློས་འཁོར་འདུས་པ་ཆེན་པོ་དེ་མཐོང་ནས། རང་གི་བསོད་ནམས་ཀྱི་སྟོབས་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། གཟུངས་ཀྱི་སྟོབས་དང་། སྤོབས་པའི་སྟོབས་དང་། མི་འཇིགས་པའི་སྟོབས་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་སྟོབས་ཀྱིས་དྲི་བ་ཆེད་དུ་མཛད་པ་བྱེ་བ་ཕྲག་བརྒྱ་པོ་དེ་ཀུན་དུ་བཟུང་ནས།
en: “Then, once the bodhisattva had seen this assembly gather, by the power of his own merit, wisdom, mindfulness, dhāraṇī, eloquence, and fearlessness, as well as by the power of the blessing of the buddhas, he fielded all the many well-considered questions that had been asked.

source: བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེའི་མདུན་དུ་དྲི་བ་བྱེ་བ་ཕྲག་བརྒྱ་པོ་རེ་རེ་ལ་བསྟན་པ་བྱེ་བ་ཕྲག་བརྒྱས་ལན་བཏབ་སྟེ།
en: In the presence of that buddha and in front of the entire assembly, he provided countless explanations for each and every one of the many questions.

source: ཕྱད་པ་དང་། རྒྱུན་ཆད་པ་མེད་པ་དང་། རྗེས་སུ་ལྡན་པ་དང་། རྗེས་སུ་འབྲེལ་བ་དང་། ཚིག་དང་ཡིག་འབྲུར་ལྡན་པ་དང་། ཤིན་ཏུ་ངེས་པའི་ཚིག་རྣམས་ཀྱིས་དེའི་ལན་བཏབ་པ་དང་།
en: He replied fluently, without interruption, coherently, and with the right words, syllables, and etymologies.

source: འཁོར་དེ་ལས་སྲོག་ཆགས་སྟོང་ཕྲག་དྲུག་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཞི་བཅུ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: In that manner, sixty thousand members of the assembly generated the thought of perfect awakening, and forty thousand bodhisattvas attained acceptance of the nonorigination of phenomena.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་སྦས་དེས་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One expressed his approval of the answers.

source: ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཀྱིས་གོ་བར་གྱུར་ཏོ། །
en: The melody carrying the sound of his approval reverberated throughout the entire trichiliocosm.

source: ས་བླ་པའི་ལྷ་ནས་བཟུང་སྟེ། གནས་གཙང་མའི་རིས་ཀྱི་བར་གྱི་ལྷ་རྣམས་ཀྱིས། ཀྱེ་མ་
en: “All the gods, from the celestial gods up to the gods of the pure abodes, proclaimed, ‘Listen!

source: གང་ཤེས་རབ་དང་། སྤོབས་པ་དང་། བསྟན་པ་འདི་འདྲ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་སུ་འགྱུར་རོ་ཞེས་སྒྲ་ཕྱུང་སྟེ་སྒྲ་བསྒྲགས་སོ། །
en: Someone of such insight, eloquence, and skill in teaching will become a bodhisattva called Prajñākūṭa!’

source: དེ་ལྟར་ན་དེ་ཤེས་རབ་བརྩེགས་ཤེས་རབ་བརྩེགས་ཞེས་མིང་དུ་བཏགས་སོ། །
en: In this way, Prajñākūṭa received the name Prajñākūṭa.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པའི་བློ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་དོགས་ཤིང་ཡིད་གཉིས་སུ་གྱུར་ཏམ། ཐེ་ཚོམ་ཟ་བ་ལྟ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: “Son of noble family, you may wonder, doubt, or ponder whether the bodhisattva called Smṛtibuddhi was someone else at that time, but you should not.

source: བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲན་པའི་བློ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: It was bodhisattva Prajñākūṭa himself who was the bodhisattva called Smṛtibuddhi at that time!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་རྒྱ་ཆེར་བརྗོད་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: At this point, the Blessed One spoke these verses in order to elaborate on this point:

source: མ་མོས་གྱུར་ནས་མ་ཐོས་ཆོས་རྣམས་རྟག་ཉན་པ། །ཤེས་རབ་རྩ་བ་སེམས་ཅན་དག་པས་ཐོབ་ནས་ནི། །
en: “Listening constantly to teachings not yet heard or sought, Pure beings attain the source of insight.

source: འཛིན་ཅིང་བྱམས་པས་འགྲོ་བ་དག་ལ་སྟོན་བྱེད་པ། །ཤེས་རབ་ལས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བྱེད། །
en: Retaining them and teaching beings with love, Bodhisattvas continually perform the function of insight.

source: དཔྱོད་པའི་དྲན་པ་ཆེན་པོ་འདི་ནི་ཤེས་རབ་རྩ། །དཔྱད་ནས་འགྲོ་ལ་རྟག་ཏུ་སྟོན་པ་ཤེས་རབ་ལས། །
en: “Great mindfulness in investigation is a source of insight. Its function is to constantly teach beings on the basis of such investigation.

source: གལ་ཏེ་ཚུལ་བཞིན་རབ་སྲེག་འདི་ནི་ཤེས་རབ་རྩ། །དེ་ལ་སྦྱར་ནས་སྟོན་པ་ཤེས་རབ་ལས་ཞེས་བྱ། །
en: Proper incineration of false views is a source of insight. Its function is to teach based on such engagement.

source: ཡང་དག་སྦྱོར་ལ་གལ་ཏེ་སྦྱོར་བ་ཤེས་རབ་རྩ། །
en: “Correct application is a source of insight.

source: སྒྲུབ་ཅིང་སྟོན་པར་བྱེད་པ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to yield accomplishments and teachings.

source: སེམས་ལ་ངེས་པར་སེམས་རྙེད་འདི་ནི་ཤེས་རབ་རྩ། །
en: Finding mental certainty regarding the mind is a source of insight.

source: ངེས་པར་སེམས་པ་སྤྱོད་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to act upon this certainty.

source: གཅིག་པུ་དབེན་པར་སྤྱོད་པ་འདི་ནི་ཤེས་རབ་རྩ། །
en: “Practicing alone in solitude is a source of insight.

source: ལུས་དང་སེམས་ལ་ངའི་མེད་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to be without an I in body or mind.

source: གང་ཚེ་འདུ་འཛིའི་འཇིགས་གྱུར་དེ་ནི་ཤེས་རབ་རྩ། །
en: Being wary of hustle and bustle is a source of insight.

source: གཅིག་པུ་བགྲོད་པའི་ལམ་ལ་རིག་བྱེད་ཤེས་རབ་ལས། །
en: Its function is to raise awareness regarding the path traversed alone.

source: ཞི་གནས་ལྷག་མཐོང་དགའ་བ་འདི་ནི་ཤེས་རབ་རྩ། །
en: “Delighting in tranquil abiding and special insight is a source of insight.

source: རིག་དང་རྣམ་པར་གྲོལ་ལ་རེག་འདི་ཤེས་རབ་ལས། །
en: Its function is to get in touch with awareness and liberation.

source: རྣམ་ཐར་གསུམ་ལ་མངོན་པར་བརྩོན་པ་ཤེས་རབ་རྩ། །
en: Pursuing the three liberations is a source of insight.

source: རིག་གསུམ་མངོན་དུ་བྱེད་པ་ཤེས་རབ་ལས་ཞེས་བྱ། །
en: Its function is to manifest threefold awareness.

source: གལ་ཏེ་དྲན་པ་ཉེར་གཞག་སྒོམ་པ་ཤེས་རབ་རྩ། །
en: “Cultivating the application of mindfulness is a source of insight.

source: དྲན་མེད་ཡིད་ལ་བྱེད་མེད་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to be without mindfulness and without and mental activity.

source: སྡིག་པ་སྤངས་ཏེ་དགེ་བ་སྤྱོད་པ་ཤེས་རབ་རྩ། །
en: Abandoning evil and practicing virtue are sources of insight.

source: ཆོས་འདི་རང་བཞིན་སྤངས་པ་དེ་ནི་ཤེས་རབ་ལས། །
en: Their function is to naturally abandon these factors.

source: གལ་ཏེ་རྫུ་འཕྲུལ་རྐང་པ་བཞི་སྒོམ་ཤེས་རབ་རྩ། །
en: “Cultivating the four bases of miraculous powers is a source of insight.

source: ལྷུན་གྲུབ་རྫུ་འཕྲུལ་ཐོབ་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to spontaneously attain miraculous power.

source: དད་པས་མོས་ནས་ཡིད་ཆེས་པ་ནི་ཤེས་རབ་རྩ། །
en: Confidence with faithful devotion is a source of insight.

source: ཆགས་པ་ཐམས་ཅད་གང་བྲལ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to be free of any attachments whatsoever.

source: ཞུམ་མེད་རྟག་ཏུ་བརྩོན་པ་དེ་ནི་ཤེས་རབ་རྩ། །
en: “Striving constantly and without growing fainthearted is a source of insight.

source: ལུས་དང་ཡིད་སེམས་རབ་སྦྱངས་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to be well trained in body and mind.

source: དྲན་དང་ཤེས་བཞིན་མཁས་པ་འདི་ནི་ཤེས་རབ་རྩ། །
en: Mastery in mindfulness and introspection is a source of insight.

source: གནས་རྣམས་ཀུན་ལ་མི་གནས་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is not to fixate on any point.

source: རང་གིས་ཏིང་འཛིན་རྟོགས་པ་དེ་ནི་ཤེས་རབ་རྩ། །
en: “Realizing meditative absorption by oneself is a source of insight.

source: རང་བཞིན་མཉམ་པར་བཞག་ལ་སྤྱོད་འདི་ཤེས་རབ་ལས། །
en: Its function is to progress naturally in equipoise.

source: གལ་ཏེ་ཤེས་རབ་དབང་པོར་རབ་གནས་ཤེས་རབ་རྩ། །
en: Being well established in the faculty of insight is a source of insight.

source: འགྲོ་བའི་དབང་པོ་ཐམས་ཅད་ཤེས་པ་ཤེས་རབ་ལས། །
en: Its function is to know all the faculties of beings.

source: སྟོབས་ལྔ་པོ་དག་རྗེས་སུ་སྒོམ་པ་ཤེས་རབ་རྩ། །བཅོམ་ནས་
en: “Cultivating the five strengths is a source of insight.

source: ཡེ་ཤེས་ཐོབ་པ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to attain wisdom following such victory.

source: བྱང་ཆུབ་ཡན་ལག་རྗེས་འཐུན་བཟོད་པ་ཤེས་རབ་རྩ། །
en: Harmoniously accepting the factors of awakening is a source of insight.

source: ཆོས་ཀུན་རྗེས་སུ་གང་རྟོགས་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to gain realization that accords with all phenomena.

source: ལམ་གྱི་ཡན་ལག་སྐྱེ་གནས་སྒྲུབ་པ་ཤེས་རབ་རྩ། །
en: “Practicing the branches of the path in this birth is a source of insight.

source: ཆོས་དང་ཆོས་མིན་སྤོང་བ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to leave behind both Dharma and non-Dharma.

source: སྡུག་བསྔལ་རང་བཞིན་མཁས་པ་འདི་ནི་ཤེས་རབ་རྩ། །
en: Being skilled in the nature of suffering is a source of insight.

source: གལ་ཏེ་འགོག་པ་མངོན་སུམ་བྱེད་འདི་ཤེས་རབ་ལས། །
en: Its function is to actualize cessation.

source: དྲང་བའི་དོན་གྱི་མདོ་སྡེ་ཚིག་འཛིན་ཤེས་རབ་རྩ། །
en: “Retaining the words of the provisional sūtras is a source of insight.

source: ངེས་པའི་དོན་ལ་རྟོན་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to rely on the definitive meaning.

source: ཐམས་ཅད་ཐོས་པས་མི་ངོམས་འདི་ནི་ཤེས་རབ་རྩ། །
en: Not being content with what one has learned is a source of insight.

source: དོན་ལ་རབ་ཏུ་རྟོན་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to rely on the meaning.

source: རྣམ་པར་ཤེས་ལ་ཚུལ་བཞིན་ཚོལ་བ་ཤེས་རབ་རྩ། །
en: “Investigating consciousness is a source of insight.

source: ཡེ་ཤེས་ལ་ནི་རབ་ཏུ་རྟོན་འདི་ཤེས་རབ་ལས། །
en: Its function is to rely on wisdom.

source: གང་ཟག་གང་ལའང་མ་ཞེན་འདི་ནི་ཤེས་རབ་རྩ། །
en: Not clinging to any individual is a source of insight.

source: གལ་ཏེ་ཆོས་ཉིད་རྟོན་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to rely on the nature of reality.

source: འདུ་བྱེད་མི་རྟག་ཡོངས་སུ་ཚོལ་བ་ཤེས་རབ་རྩ། །
en: “Scrutinizing karmic formations as impermanent is a source of insight.

source: གལ་ཏེ་གཟོད་ནས་མ་སྐྱེས་ཤེས་པ་ཤེས་རབ་ལས། །
en: Its function is to know they are originally unborn.

source: འདུ་བྱེད་སྡུག་བསྔལ་མོས་པར་བྱེད་པ་ཤེས་རབ་རྩ། །
en: Attending to formations as painful is a source of insight.

source: ཆོས་རྣམས་འདུས་མ་བྱས་སུ་མོས་པ་ཤེས་རབ་ལས། །
en: Its function is to attend to phenomena as being unconditioned.

source: ཆོས་རྣམས་བདག་མེད་ཐེ་ཚོམ་མེད་པ་ཤེས་རབ་རྩ། །
en: “Having no doubt that all phenomena are without self is a source of insight.

source: སེམས་ཅན་འདི་དག་གདོད་ནས་དག་དེ་ཤེས་རབ་ལས། །
en: Its function is to know the primordial purity of beings.

source: མྱ་ངན་འདས་ལ་ཞི་བར་མོས་པ་ཤེས་རབ་རྩ། །
en: Appreciating that nirvāṇa is peace is a source of insight.

source: འགྲོ་བ་ཤིན་ཏུ་མྱ་ངན་འདས་འདི་ཤེས་རབ་ལས། །
en: Its function is to know that beings are nirvāṇa.

source: དོན་གྱི་རྗེས་སུ་རྟོགས་པ་འདི་ནི་ཤེས་རབ་རྩ། །
en: “Realization that accords with truth is a source of insight.

source: དོན་རྟོགས་སོ་སོ་ཡང་དག་རིག་པ་ཤེས་རབ་ལས། །
en: Its function is to have special awareness of the truth.

source: གལ་ཏེ་ཆོས་ཉིད་མོས་པར་བྱེད་པ་ཤེས་རབ་རྩ། །
en: Gaining appreciation of the nature of reality is a source of insight.

source: ཆོས་ལ་སོ་སོ་ཡང་དག་རིག་པ་ཤེས་རབ་ལས། །
en: Its function is to have special awareness of phenomena.

source: སྒྲ་རྣམས་ཀུན་ལ་སྐྲག་པ་མེད་འདི་ཤེས་རབ་རྩ། །
en: “Being unintimidated by any words is a source of insight.

source: ངེས་ཚིག་སོ་སོ་ཡང་དག་རིག་འདི་ཤེས་རབ་ལས། །
en: Its function is to have special awareness of etymologies.

source: སྐྲག་མེད་བློ་ཡིས་སྤོབས་པ་དེ་ནི་ཤེས་རབ་རྩ། །
en: Being unintimidated by eloquence is a source of insight.

source: སྤོབས་པ་སོ་སོ་ཡང་དག་རིག་པ་ཤེས་རབ་ལས། །
en: Its function is to have special awareness of eloquence.

source: གལ་ཏེ་སེམས་ཅན་གནས་པའི་བྱམས་དེ་ཤེས་རབ་རྩ། །
en: “Feeling abiding love for beings is a source of insight.

source: དམིགས་པ་མེད་པའི་བྱམས་ཐོབ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to attain nonreferential love.

source: བདག་དང་གཞན་ལ་སྙིང་རྗེ་འདི་ནི་ཤེས་རབ་རྩ། །
en: Feeling compassion for self and others is a source of insight.

source: གང་གིས་གཉི་གར་མི་རྟོག་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is not to conceive of either.

source: མཆོག་ཏུ་དགའ་ལ་དགའ་བ་ཐོབ་འདི་ཤེས་རབ་རྩ། །
en: “Delighting in supreme joy is a source of insight.

source: དགའ་མེད་གདུང་བ་མེད་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is not to feel joy or anguish.

source: བྱམས་དང་གནོད་པར་མི་བྱེད་དེ་ནི་ཤེས་རབ་རྩ། །
en: Being neither desirous nor harmful in conduct is a source of insight.

source: གཉིས་ལས་སེམས་གྲོལ་ཐོབ་པ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to attain mental release from duality.

source: བློ་གྲོས་ལྡན་པ་སངས་རྒྱས་དྲན་འདི་ཤེས་རབ་རྩ། །
en: “Recollecting the wise Buddha is a source of insight.

source: གང་ཚེ་ཆོས་སྐུ་རྗེས་སུ་རྟོགས་པ་ཤེས་རབ་ལས། །
en: Its function is to realize dharmakāya.

source: ཆོས་ཀྱང་རྟག་ཏུ་དྲན་པ་འདི་ནི་ཤེས་རབ་རྩ། །
en: Constantly recollecting the Dharma is a source of insight.

source: ཆོས་རྣམས་འདོད་ཆགས་བྲལ་བར་རྟོགས་པ་ཤེས་རབ་ལས། །
en: Its function is to realize the nature of reality without any attachment.

source: ཡོན་ཏན་ལས་ནི་དགེ་འདུན་དྲན་དེ་ཤེས་རབ་རྩ། །
en: “Recollecting the Saṅgha in terms of its qualities is a source of insight.

source: དེ་ཡང་འདུས་མ་བྱས་སུ་རྟོགས་པ་ཤེས་རབ་ལས། །
en: Its function is to realize it as it as unconditioned.

source: བློ་ལྡན་གཏོང་བ་དྲན་པ་དེ་ནི་ཤེས་རབ་རྩ། །
en: Recollecting wise generosity is a source of insight.
